<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"EKS","backend":"60748d58729bf4548a54266386c47e6c390cab0e81de2f344b56ea8c073bdad0","plan_job_ref":"Job tf-plan / Kabisa-playground-anas #10 at https://github.com/anasgrt/eks_project/actions/runs/8583726395","plan_out_hash":"2228913210026716889236512b45b0f9b70e70d616a8c4e9baf2eee78cae1b5b","plan_hash":"a46b038da7c8bff11be57e4c776108f297da45694bba4d79988fc98b4827bbb7","plan_text_format":"diff","version":"1.42.0"} -->
Terraform plan for __EKS__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # helm_release.alb_ingress_controller will be created
+   resource "helm_release" "alb_ingress_controller" {
+       atomic                     = false
+       chart                      = "aws-load-balancer-controller"
+       cleanup_on_fail            = false
+       create_namespace           = false
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "alb-ingress-controller"
+       namespace                  = "kube-system"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://aws.github.io/eks-charts"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       values                     = [
+           <<-EOT
                "clusterName": "education-cluster"
                "region": "eu-west-1"
                "serviceAccount":
                  "annotations":
                    "eks.amazonaws.com/role-arn": "arn:aws:iam::820116308106:role/CodeCationALBIngressController"
                  "name": "aws-load-balancer-controller"
                "vpcId": "vpc-07b6578c93385519a"
            EOT,
        ]
+       verify                     = false
+       version                    = "1.7.2"
+       wait                       = true
+       wait_for_jobs              = false
    }

  # kubernetes_service_account.service-account will be created
+   resource "kubernetes_service_account" "service-account" {
+       automount_service_account_token = true
+       default_secret_name             = (known after apply)
+       id                              = (known after apply)

+       metadata {
+           annotations      = {
+               "eks.amazonaws.com/role-arn"               = "arn:aws:iam::820116308106:role/CodeCationALBIngressController"
+               "eks.amazonaws.com/sts-regional-endpoints" = "true"
+               "meta.helm.sh/release-name"                = "alb-ingress-controller"
+               "meta.helm.sh/release-namespace"           = "kube-system"
            }
+           generation       = (known after apply)
+           labels           = {
+               "app.kubernetes.io/component"  = "controller"
+               "app.kubernetes.io/managed-by" = "Helm"
+               "app.kubernetes.io/name"       = "aws-load-balancer-controller"
            }
+           name             = "aws-load-balancer-controller"
+           namespace        = "kube-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

:x: Plan not applied in [tf-apply / Kabisa-playground-anas #5](https://github.com/anasgrt/eks_project/actions/runs/8588166688) (Plan has changed)